Autodesk.Revit.DB.AreaElemType
An enumerated type to store type of AreaElement.

Autodesk.Revit.DB.AreaElemType.BOMAArea
Office Area Scheme - uses BOMA rules for space classification.

Autodesk.Revit.DB.AreaElemType.GrossArea
Gross Area Scheme - only 2 types of spaces (internal and external).